<?php
$title="Главная страница"; // название формы
require __DIR__ . '/header.php'; // подключаем шапку проекта
require "db.php"; // подключаем файл для соединения с БД
?>



<div class="logo_text" align="center">
	<h1>WorkStudy</h1>
	<h2>научим работать правильно</h2>
	<h4>Сервис по подбору персонала с безграничными возможностями</h4>
</div>






<!-- Если авторизован выведет приветствие -->
<?php if(isset($_SESSION['logged_user'])) : ?>
	<!-- Пользователь может нажать выйти для выхода из системы -->
	<!-- файл logout.php создадим ниже -->

	<div class="btnsingup" align="center">
		<a href="work.php"><button type="button" class="btn btn-success">Поиск работы</button></a>
		<a href="logout.php"><button type="button" class="btn btn-outline-dark">Выйти</button> </a>
	</div>
	<?php else : ?>

		<!-- Если пользователь не авторизован выведет ссылки на авторизацию и регистрацию -->
	

		<div class="btnsingup" align="center">
			<a href="login.php"><button type="button" class="btn btn-success">Авторизоваться</button></a>
			<a href="signup.php"><button type="button" class="btn btn-outline-dark">Регистрация</button> </a>
		</div>
		<!----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ВСТАВИТЬ СТРАНИЦУ РОМЫ  И ПОМЕНЯТЬ АВТОРИЗОВАННУЮ СТРАНИЦУ ВЫШЕ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------->


		

	<?php endif; ?>

<?php require __DIR__ . '/footer.php'; ?> <!-- Подключаем подвал проекта -->